tap "homebrew/bundle"
brew "bat"
brew "bzip2"
brew "eza"
brew "exercism"
brew "gh"
brew "git"
brew "kubectx"
brew "minikube"
brew "mise"
brew "starship"
brew "stow"
brew "telnet"
brew "tldr"
brew "tmux"
cask "alacritty"
cask "bluesnooze"
cask "font-jetbrains-mono-nerd-font"
cask "hiddenbar"
cask "monitorcontrol"
cask "orbstack"
